Tekla Open API Reference for Tekla Structures 2025
RebarItem Properties
The RebarItem type exposes the following members.
Properties
Name | Description
ActualDiameter
 The rebar item's actual diameter.
BendRadius
 The rebar item's bending radius.
Code
 The rebar item's code.
CrankedLength
 Gets or sets the cranked length.
CrankedLengthType
 Gets or sets the cranked length type.
CrankExtraOffset
 Gets or sets the crank extra offset.
CrankStraightLength
 Gets or sets the crank straight length.
CrossSectionArea
 The rebar item's cross section area.
CurveTolerance
 Gets or sets the curve tolerance.
ExtraPointShortening
 Gets or sets the extra point shortening.
Grade
 The rebar item's grade.
HookLength135Degrees
 The rebar item's hook length for 135 degrees.
HookLength180Degrees
 The rebar item's hook length for 180 degrees.
HookLength90Degrees
 The rebar item's hook length for 90 degrees.
HookRadius135Degrees
 The rebar item's hook radius for 135 degrees.
HookRadius180Degrees
 The rebar item's hook radius for 180 degrees.
HookRadius90Degrees
 The rebar item's hook radius for 90 degrees.
LapLength
 Gets or sets the lap length.
MaxRadiusRequiringBending
 Gets or sets the max radius requiring bending.
NominalDiameter
 The rebar item's nominal diameter.
Size
 The rebar item's size.
Usage
 The rebar item's usage.
WeightPerLenght
 The rebar item's weight per lenght.
Top
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace